Config/Documents/ПереносОстатков198нНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПереносОстатков198нНФА</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.УчетныеДанныеОбъектаОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииПереносОстатков198нНФА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборКФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПерехода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Переводы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСтарый</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНовый</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦМО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/ОперацииПереносОстатков198нНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОперацииПереносОстатков198нНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложенияНМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложенияМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложенияМЗ_НУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложенияКонцессия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложенияИК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложенияПрочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИКПрочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИККонцессия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбесценениеНПА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученноеВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученноеВПользованиеАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученноеВПользованиеИК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаХраненииОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаХраненииМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаХраненииОСИК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаХраненииМЗИК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученноеПоЦСОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученноеПоЦСМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗабалансПрочиеОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗабалансПрочиеМЗ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПереносОстатков198нНФА/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПерехода) Тогда
		Объект.ДатаПерехода = '20210101';
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтразитьПараметрыОперацииНаФорме();
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.ПереносОстатков198нНФА.Форма.ФормаУстановка" Тогда
		ЗаполнитьЗначенияПоСписку(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.Переводы.Очистить();
	
	ОтразитьПараметрыОперацииНаФорме();
	
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборСчета(Элемент, Объект.ОтборСчет, ПолучитьПараметрыОперации().Счета, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Переводы

&НаКлиенте
Процедура ПереводыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаполнитьСтрокуТЧ(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводыСчетНовыйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.Переводы.ТекущиеДанные;
	СписокСчетов = НовыеСчетаОперации(ТекСтрока.СчетСтарый);
	
	ВыборСчета(Элемент, ТекСтрока.СчетНовый, СписокСчетов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)
	
	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОбъектов(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе,МножественныйВыбор", Ложь, Истина);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Переводы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗаполнить(Команда)
	
	Если Объект.Переводы.Количество() > 0 Тогда
		Если Объект.Проведен Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Заполнение возможно только в не проведеном документе'"));
		Иначе
			ТекстВопроса = "Таблица переноса будет очищена. Продолжить?";
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбъектыЗаполнитьПослеЗакрытияВопроса", ЭтаФорма, Параметры);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	Иначе
		ЗаполнитьТаблицуПереносаСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗаполнитьПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуПереносаСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСтарыйСчет(Команда)
	
	ПерезаполнитьСтарыйСчетСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначение(Команда)
	
	ПараметрыОперации = ПолучитьПараметрыОперации();
	
	СписокСчетов = Новый Массив;
	Для Каждого Правило Из ПараметрыОперации.Правила Цикл
		Для Каждого СчетОперации Из Правило.СчетНовый Цикл
			Если СписокСчетов.Найти(СчетОперации.Значение) = Неопределено Тогда
				СписокСчетов.Добавить(СчетОперации.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация"	, Объект.Организация);
	ПараметрыФормы.Вставить("ДатаПерехода"	, Объект.ДатаПерехода);
	ПараметрыФормы.Вставить("СписокСчетов"	, СписокСчетов);
	ПараметрыФормы.Вставить("ЕстьЦМО"		, ПараметрыОперации.ЕстьЦМО);
	ПараметрыФормы.Вставить("ЕстьДоговор"	, ПараметрыОперации.ЕстьДоговор);
	
	ОткрытьФорму("Документ.ПереносОстатков198нНФА.Форма.ФормаУстановка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ИнициализироватьПараметрыОпераций();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПараметрыОпераций()
	
	ПравилаПереноса = Новый ТаблицаЗначений;
	ПравилаПереноса.Колонки.Добавить("Операция"			, Новый ОписаниеТипов("Строка"));
	ПравилаПереноса.Колонки.Добавить("СчетСтарый"		, Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПравилаПереноса.Колонки.Добавить("СчетНовый"		, Новый ОписаниеТипов("СписокЗначений"));
	ПравилаПереноса.Колонки.Добавить("Описание"			, Новый ОписаниеТипов("Строка"));
	ПравилаПереноса.Колонки.Добавить("ТипОбъекта"		, Новый ОписаниеТипов("Строка"));
	ПравилаПереноса.Колонки.Добавить("ОтборИК"			, Новый ОписаниеТипов("Строка"));
	ПравилаПереноса.Колонки.Добавить("ЕстьЦМО"			, Новый ОписаниеТипов("Булево"));
	ПравилаПереноса.Колонки.Добавить("ЕстьДоговор"		, Новый ОписаниеТипов("Булево"));
	ПравилаПереноса.Колонки.Добавить("ЕстьКонтрагент"	, Новый ОписаниеТипов("Булево"));
	
	Макет = Документы.ПереносОстатков198нНФА.ПолучитьМакет("Настройки");
	Для Сч = 2 По Макет.ВысотаТаблицы Цикл
		Операция = СокрЛП(Макет.Область("R"+Сч+"C1").Текст);
		Если Не ПустаяСтрока(Операция) Тогда
			
			СписокСчетов = СписокСчетовПоКодуИДате(Макет.Область("R"+Сч+"C2").Текст);
			СчетСтарый = ?(СписокСчетов.Количество() > 0, СписокСчетов[0], Неопределено);
			
			СписокСчетов = СписокСчетовПоКодуИДате(Макет.Область("R"+Сч+"C3").Текст);
			СчетНовый = Новый СписокЗначений;
			СчетНовый.ЗагрузитьЗначения(СписокСчетов);
			
			НоваяСтрока					= ПравилаПереноса.Добавить();
			НоваяСтрока.Операция		= Операция;
			НоваяСтрока.СчетСтарый		= СчетСтарый;
			НоваяСтрока.СчетНовый		= СчетНовый;
			НоваяСтрока.Описание		= СокрЛП(Макет.Область("R"+Сч+"C4").Текст);
			НоваяСтрока.ТипОбъекта		= СокрЛП(Макет.Область("R"+Сч+"C5").Текст);
			НоваяСтрока.ОтборИК			= СокрЛП(Макет.Область("R"+Сч+"C6").Текст);
			НоваяСтрока.ЕстьЦМО			= ЗначениеЗаполнено(СокрЛП(Макет.Область("R"+Сч+"C7").Текст));
			НоваяСтрока.ЕстьДоговор		= ЗначениеЗаполнено(СокрЛП(Макет.Область("R"+Сч+"C8").Текст));
			НоваяСтрока.ЕстьКонтрагент	= ЗначениеЗаполнено(СокрЛП(Макет.Область("R"+Сч+"C9").Текст));
			
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОпераций.Очистить();
	
	ЗаголовкиТипа = Новый Соответствие;
	ЗаголовкиТипа.Вставить("ОС"			, "Основные средства");
	ЗаголовкиТипа.Вставить("НМА"		, "Нематериальные активы");
	ЗаголовкиТипа.Вставить("НПА"		, "Непроизведеные активы");
	ЗаголовкиТипа.Вставить("КапВложения", "Капитальные вложения");
	ЗаголовкиТипа.Вставить("МЗ"			, "Материальные запасы");
	
	Для Каждого Операция Из Перечисления.ОперацииПереносОстатков198нНФА Цикл
		
		ИмяОперации = ЗначениеРеквизитаПеречисления(Операция, "Имя");
		СтрокиПравил = ПравилаПереноса.НайтиСтроки(Новый Структура("Операция", ИмяОперации));
		ПравилаОперации = ПравилаПереноса.Скопировать(СтрокиПравил, "СчетСтарый,СчетНовый");
		
		СчетаОперации = ПравилаОперации.ВыгрузитьКолонку("СчетСтарый");
		
		ПараметрыОперации = ПараметрыОпераций.Добавить();
		ПараметрыОперации.Операция = Операция;
		ПараметрыОперации.Правила.Загрузить(ПравилаОперации);
		ПараметрыОперации.Счета.ЗагрузитьЗначения(СчетаОперации);
		Если СтрокиПравил.Количество() > 0 Тогда
			ПараметрыОперации.Описание			= СтрокиПравил[0].Описание;
			ПараметрыОперации.ОтборИК			= СтрокиПравил[0].ОтборИК;
			ПараметрыОперации.ЕстьЦМО			= СтрокиПравил[0].ЕстьЦМО;
			ПараметрыОперации.ЕстьДоговор		= СтрокиПравил[0].ЕстьДоговор;
			ПараметрыОперации.ЕстьКонтрагент	= СтрокиПравил[0].ЕстьКонтрагент;
			ПараметрыОперации.ЭтоМЗ				= (СтрокиПравил[0].ТипОбъекта = "МЗ" Или ИмяОперации = "КапВложенияМЗ" Или ИмяОперации = "КапВложенияМЗ_НУ");
			ПараметрыОперации.Заголовок			= ЗаголовкиТипа[СтрокиПравил[0].ТипОбъекта];
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОперации				= ПараметрыОпераций.Добавить();
	ПараметрыОперации.Операция		= Перечисления.ОперацииПереносОстатков198нНФА.ПустаяСсылка();
	ПараметрыОперации.ЭтоМЗ			= Ложь;
	ПараметрыОперации.Заголовок		= ЗаголовкиТипа["ОС"];
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокСчетовПоКодуИДате(СтрокаКодов)
	
	МассивКодов = СтрРазделить(СтрокаКодов, Символы.ПС, Ложь);
	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(6)));
	ТаблицаКодов.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Для Каждого ТекКод Из МассивКодов Цикл
		пТекКод = СокрЛП(ТекКод);
		НоваяСтрока = ТаблицаКодов.Добавить();
		ПозицияТочек = Найти(пТекКод, ":");
		Если ПозицияТочек = 0 Тогда
			НоваяСтрока.Код        = пТекКод;
			НоваяСтрока.ДатаНачала = Дата(1,1,1);
		Иначе	
			НоваяСтрока.Код        = Лев(пТекКод, (ПозицияТочек - 1));
			НоваяСтрока.ДатаНачала = Дата(Сред(пТекКод, (ПозицияТочек + 1)));
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКодов.Код КАК Код,
	|	НАЧАЛОПЕРИОДА(ТаблицаКодов.ДатаНачала, ДЕНЬ) КАК ДатаНачала
	|ПОМЕСТИТЬ ТабКодов
	|ИЗ
	|	&ТаблицаКодов КАК ТаблицаКодов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабКодов КАК ТабКодов
	|		ПО ЕПСБУ.Код = ТабКодов.Код
	|			И ЕПСБУ.ДатаНачалаДействия = ТабКодов.ДатаНачала";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаКодов", ТаблицаКодов);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаПеречисления(Значение, Реквизит)
	
	Мет			= Значение.Метаданные();
	Индекс		= Перечисления[Мет.Имя].Индекс(Значение);
	Результат	= Мет.ЗначенияПеречисления[Индекс][Реквизит];
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПараметрыОперации()
	
	Возврат ПараметрыОпераций.НайтиСтроки(Новый Структура("Операция", Объект.ВидОперации))[0];
	
КонецФункции

&НаКлиенте
Процедура ОтразитьПараметрыОперацииНаФорме()
	
	ПараметрыОперации = ПолучитьПараметрыОперации();
	
	Элементы.ВидОперации.РасширеннаяПодсказка.Заголовок = ПараметрыОперации.Описание;
	
	Элементы.ПереводыОбъектУчета.Заголовок	= ПараметрыОперации.Заголовок;
	Элементы.ПереводыКонтрагент.Видимость	= ПараметрыОперации.ЕстьКонтрагент;
	Элементы.ПереводыЦМО.Видимость			= ПараметрыОперации.ЕстьЦМО;
	Элементы.ПереводыДоговор.Видимость		= ПараметрыОперации.ЕстьДоговор;
	
	Элементы.ПереводыПодборОбъектов.Видимость = (Объект.ВидОперации =
		ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатков198нНФА.МЗ"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПереносаСервер()
	
	Результат = ПолучитьТаблицуОстатков();
	Объект.Переводы.Загрузить(Результат);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуОстатков(СписокОбъектов = Неопределено)
	
	ПараметрыОперации = ПараметрыОпераций.НайтиСтроки(Новый Структура("Операция", Объект.ВидОперации))[0];
	
	СписокСчетов = ПараметрыОперации.Счета.ВыгрузитьЗначения();
	
	Субконто = Новый Массив;
	Если ПараметрыОперации.ЭтоМЗ Тогда
		Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Иначе
		Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	КонецЕсли;
	
	Если ПараметрыОперации.ЕстьКонтрагент Тогда
		Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"		, Объект.ДатаПерехода);
	Запрос.УстановитьПараметр("Счет"		, СписокСчетов);
	Запрос.УстановитьПараметр("Субконто"	, Субконто);
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Остатки.Счет КАК СчетСтарый,
	|	Остатки.Субконто1 КАК ОбъектУчета
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счет),
	|			&Субконто,
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Подразделение = &Подразделение
	|				И Субконто1 В (&СписокОбъектов)) КАК Остатки
	|ГДЕ
	|	&ДопУсловие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.Счет.Порядок,
	|	ОбъектУчета";
	
	Если ПараметрыОперации.ЕстьКонтрагент Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ОбъектУчета", "КАК ОбъектУчета,
			|	Остатки.Субконто2 КАК Контрагент");
	КонецЕсли;
		
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
		Запрос.УстановитьПараметр("ИФО", Объект.ОтборИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИФО = &ИФО", "");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") И ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение = &Подразделение", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОтборСчет) Тогда
		Запрос.УстановитьПараметр("Счет", Объект.ОтборСчет);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
		Запрос.УстановитьПараметр("КФО", Объект.ОтборКФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КФО = &КФО", "");
	КонецЕсли;
	
	Если СписокОбъектов = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Субконто1 В (&СписокОбъектов)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектов);
	КонецЕсли;
	
	ДопУсловие = "ИСТИНА";
	Если ЗначениеЗаполнено(ПараметрыОперации.ОтборИК) Тогда
		ДопУсловие = "ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.ОсновныеСредства).ИмуществоКазны = " + ПараметрыОперации.ОтборИК;
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловие", ДопУсловие);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("СчетНовый");
	
	Для Каждого ТекСтрока Из Результат Цикл
		СписокНовыхСчетов = ПолучитьНовыйСчет(ПараметрыОперации.Правила, ТекСтрока);
		Если СписокНовыхСчетов.Количество() = 1 Тогда
			ТекСтрока.СчетНовый = СписокНовыхСчетов[0];
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьНовыйСчет(Правила, ТекСтрока)
	
	Для Каждого СтрокаОперации Из Правила Цикл
		Если СтрокаОперации.СчетСтарый = ТекСтрока.СчетСтарый Тогда
			Возврат СтрокаОперации.СчетНовый.ВыгрузитьЗначения();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Массив;
	
КонецФункции

&НаКлиенте
Функция НовыеСчетаОперации(СчетСтарый)
	
	Правила = ПолучитьПараметрыОперации().Правила;
	
	Для Каждого СтрокаОперации Из Правила Цикл
		Если СтрокаОперации.СчетСтарый = СчетСтарый Тогда
			Возврат СтрокаОперации.СчетНовый.ВыгрузитьЗначения();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Массив;
	
КонецФункции

&НаКлиенте
Процедура ВыборСчета(Владелец, ТекущиееЗначение, СписокСчетов, НовыйСчет = Истина)
	
	ДатаДляОтбора = Объект.ДатаПерехода - ?(НовыйСчет, 0, 1);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НаДату", ДатаДляОтбора);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", СписокСчетов));
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Владелец);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСтарыйСчетСервер()
	
	ПараметрыОперации = ПараметрыОпераций.НайтиСтроки(Новый Структура("Операция", Объект.ВидОперации))[0];
	
	СписокОбъектов = Объект.Переводы.Выгрузить().ВыгрузитьКолонку("ОбъектУчета");
	Результат = ПолучитьТаблицуОстатков(СписокОбъектов);
	
	ПустойСчет = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	
	Для Каждого ТекСтрока Из Объект.Переводы Цикл
		
		СтрРезультат = Результат.Найти(ТекСтрока.ОбъектУчета, "ОбъектУчета");
		
		Если СтрРезультат = Неопределено Тогда
			ТекСтрока.СчетСтарый = ПустойСчет;
		Иначе
			ТекСтрока.СчетСтарый = СтрРезультат.СчетСтарый;
			Если СтрРезультат.СчетНовый <> ПустойСчет Тогда
				ТекСтрока.СчетНовый = СтрРезультат.СчетНовый;
			ИначеЕсли ТекСтрока.СчетНовый <> ПустойСчет Тогда
				СписокНовыхСчетов = ПолучитьНовыйСчет(ПараметрыОперации.Правила, ТекСтрока);
				Если СписокНовыхСчетов.Найти(ТекСтрока.СчетНовый) = Неопределено Тогда
					ТекСтрока.СчетНовый = ПустойСчет;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуТЧ(СписокОбъектов)
	
	Данные = ПолучитьТаблицуОстатков(СписокОбъектов);
	
	Для Каждого ОбъектУчета Из СписокОбъектов Цикл
		
		НоваяСтрока = Объект.Переводы.Добавить();
		НоваяСтрока.ОбъектУчета = ОбъектУчета;
		
		ДанныеСтроки = Данные.Найти(ОбъектУчета, "ОбъектУчета");
		Если ДанныеСтроки <> Неопределено Тогда	
			НоваяСтрока.СчетСтарый	= ДанныеСтроки.СчетСтарый;
			НоваяСтрока.СчетНовый	= ДанныеСтроки.СчетНовый;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначенияПоСписку(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.СпособЗаполнения = 0 Тогда
		СтрокиЗаполнения = Объект.Переводы;
	Иначе
		СтрокиЗаполнения = Новый Массив;
		Для Каждого ВыделеннаяСтрока Из Элементы.Переводы.ВыделенныеСтроки Цикл
			СтрокиЗаполнения.Добавить(Объект.Переводы.НайтиПоИдентификатору(ВыделеннаяСтрока));
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из СтрокиЗаполнения Цикл
		
		Если ДанныеЗаполнения.Свойство("НовыйСчет") Тогда
			СтрокаТаблицы.СчетНовый = ДанныеЗаполнения["НовыйСчет"];
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ЦМО") Тогда
			СтрокаТаблицы.ЦМО = ДанныеЗаполнения["ЦМО"];
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Договор") Тогда
			СтрокаТаблицы.Договор = ДанныеЗаполнения["Договор"];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
